1)  'number' + 3 + 3
// Результат: number33
// Відбувається конкатенація рядка number з числами 3 та 3
2)  null + 3
// Результат: 3
// null розглядається як 0 в числових операціях, отже, null +3 = 0+3
3)  5 && "qwerty"
// && повертає значення другого операнда, якщо перший операнд True
//  У цьому випадку обидва операнди True, але повертається другий
4)  +'40' + +'2' + "hillel";
// Результат: 42hillel
// Унарний плюс конвертує рядок в число. Таким чином, +'40' стає 40, і +'2' стає 2
// Додавання цих двох чисел + конкатенація з рядком hillel = 42hillel
5)  '10' - 5 === 6;
// Результат: false
// Рядок '10' перетворюється в число 10, після чого віднімається 5
// === порівнює результат 5 з 6, отже, отримуємо false
6)  true + false
// Результат: 1
// true конвертується в 1, а false в 0 в числових операціях
7)  '4px' - 3
// Результат: NaN
// Рядок '4px' не можна конвертувати в число, тому результатом є NaN
8)  '4' - 3
// Результат: 1
//  Рядок '4' конвертується в число 4, і після цього відбувається віднімання
9)  '6' + 3 ** 0;
// Результат: '61'
// Зведення в ступінь `3 ** 0` дорівнює 1, тому '6' + 1 дає рядкове об'єднання
10)  12 / '6'
// Результат: 2
// Рядок '6' конвертується в число, і після цього відбувається ділення 12 на 6
11)  '10' + (5 === 6);
// Результат: '10false'
// Строге порівняння 5 === 6 обчислюється в `false`
// Рядок '10' конкатенується з булевим результатом
12)  null == ''
// Результат: false
// null не дорівнює порожньому рядку ''
13)  3 ** (9 / 3);
// Результат: 27
// 9 / 3 дорівнює 3, тому зведення в ступінь 3 ** 3 дорівнює 27
14)  !!'false' == !!'true'
// Результат: true
// Подвійний NOT конвертує false на true, а потім назад на false
// Подвійний NOT конвертує true на false, а потім назад на true
15)  0 || '0' && 1
// Результат: 1
// Оператор OR повертає true операнд. У цьому випадку '0' є true, тому отримуємо 1
16)  (+null == false) < 1;
// Результат: true
// +null конвертується в 0, 0 == false дорівнює true
// true < 1
17)  false && true || true
// Результат: true
// && повертає true, якщо обидва операнди true, інакше повертає false
// У цьому випадку false && true дорівнює false
18)  false && (false || true);
// Результат: false
// Внутрішні дужки обчислюються спочатку
// Потім йде false && true
19)  (+null == false) < 1 ** 5;
// Результат: true
// +null == false дорівнює true
// 1 ** 5 дорівнює 1
// Отже, true < 1 дорівнює true